---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustBeInMainModel
source: html/61680427-324a-c642-6eba-a5f4c07f63e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustBeInMainModel Property

Element must be in Main Model

## Syntax (C#)
```csharp
public static FailureDefinitionId MustBeInMainModel { get; }
```